In [1]:
import pandas as pd

### Data frame form python dict

In [2]:
df = pd.DataFrame({
    "name": ['Bob','Da','Builder'],
    "ctc":[7,4,14],
    "location": ['Calcutta','Bombay','Madras']
})
display(df,df['name'])

      name  ctc  location
0      Bob    7  Calcutta
1       Da    4    Bombay
2  Builder   14    Madras

0        Bob
1         Da
2    Builder
Name: name, dtype: object

## Updating the names

In [3]:
df['name'] = ['Mia','Kendra','Lucy']
df

     name  ctc  location
0     Mia    7  Calcutta
1  Kendra    4    Bombay
2    Lucy   14    Madras

## Display n columns at a time
n=2

In [4]:
df[['name','ctc']]

     name  ctc
0     Mia    7
1  Kendra    4
2    Lucy   14

## .iloc method helps us to access the rows of a dataframe

In [5]:
display(df.iloc[0],df.iloc[2]) # df.iloc[row_index]

name             Mia
ctc                7
location    Calcutta
Name: 0, dtype: object

name          Lucy
ctc             14
location    Madras
Name: 2, dtype: object

In [6]:
df.iloc[1:] # can use list slicing type syntax to view or extract specific 
# number of rows

     name  ctc location
1  Kendra    4   Bombay
2    Lucy   14   Madras

In [7]:
df.iloc[1,2]

'Bombay'

In [8]:
df.iloc[1,2]='Mumbai'
display(df,df.iloc[:,[0,2]],df.iloc[:,[0,1,2]]) # iloc[rows,[*col_idxs]]

     name  ctc  location
0     Mia    7  Calcutta
1  Kendra    4    Mumbai
2    Lucy   14    Madras

     name  location
0     Mia  Calcutta
1  Kendra    Mumbai
2    Lucy    Madras

     name  ctc  location
0     Mia    7  Calcutta
1  Kendra    4    Mumbai
2    Lucy   14    Madras

In [9]:
df.iloc[df.index %2 ==1]

     name  ctc location
1  Kendra    4   Mumbai

In [10]:
df.iloc[[0,2]]

   name  ctc  location
0   Mia    7  Calcutta
2  Lucy   14    Madras

## loc method

it is silimar to iloc method but in a column wise fashion

In [11]:
df.loc[1,'ctc']

4